##### ONE LINERS

In [1]:
b=[50,60,70]
[int(i/10) for i in b]

[5, 6, 7]

In [2]:
a=['python','java','html']
[i[-2:]for i in a]

['on', 'va', 'ml']

In [3]:
a=int(input('number here'))
[a*i for i in range(1,11)]

number here4

[4, 8, 12, 16, 20, 24, 28, 32, 36, 40]

In [4]:
[[i+10,i+12] for i in b]  #for multiple outputs

[[60, 62], [70, 72], [80, 82]]

In [5]:
i = [12, 'ten', 10.9, 67, 'xuz',78.9, 2,True]
v = {'integer':[], 'text':[], 'decimal':[],'bool':[] }

[v['integer'].append(k) if type(k)==int else v['text'].append(k) if type(k)==str else v['decimal'].append(k) if type(k)==float else v['bool'].append(k) for k in i]
v

{'integer': [12, 67, 2],
 'text': ['ten', 'xuz'],
 'decimal': [10.9, 78.9],
 'bool': [True]}

##### WHILE LOOP

In [6]:
i=2
while i<5:
    print('this is a infinite loop')
    i+=1 #i=i+1
    #break

this is a infinite loop
this is a infinite loop
this is a infinite loop

In [7]:
i=1
while i<6:
    print(i)
    if i==3:
        break
    i+=1
    print('after break',i)

1
after break 2
2
after break 3
3

In [8]:
l=[1,2,3,4]
for i in l:
    while i<5:
        print(i)
        break  #this is an Infinite Loop

1
2
3
4

In [9]:
#IN WHILE LOOP YOU NEED TO GIVE COMMAND +=1 IF YOU WANT TO PROCCED TO NEXT NUMBER

In [10]:
twister = 'My My nam is one of a kind but not multiple people have this name and of this unique'

word_count = {}

for w in twister.split() :
    if w not in word_count:
        word_count[w] = 1
    else:
        word_count[w] += 1 #w=w+1
word_count

{'My': 2,
 'nam': 1,
 'is': 1,
 'one': 1,
 'of': 2,
 'a': 1,
 'kind': 1,
 'but': 1,
 'not': 1,
 'multiple': 1,
 'people': 1,
 'have': 1,
 'this': 2,
 'name': 1,
 'and': 1,
 'unique': 1}

In [11]:
#DATE

In [15]:
import pandas as pd
import numpy as np

In [13]:
dates=pd.date_range(start='02-02-2022',end='9-02-2022',freq='22D')

In [16]:
df=pd.DataFrame(np.random.randint(low=20,high=30,size=(10,3)),index=dates,columns=list('DEF'))

In [17]:
df

             D   E   F
2022-02-02  20  24  24
2022-02-24  25  25  23
2022-03-18  23  23  20
2022-04-09  22  22  21
2022-05-01  28  28  24
2022-05-23  20  22  25
2022-06-14  24  22  23
2022-07-06  26  20  22
2022-07-28  22  22  24
2022-08-19  22  20  28

In [18]:
df.sort_index(ascending=False)

             D   E   F
2022-08-19  22  20  28
2022-07-28  22  22  24
2022-07-06  26  20  22
2022-06-14  24  22  23
2022-05-23  20  22  25
2022-05-01  28  28  24
2022-04-09  22  22  21
2022-03-18  23  23  20
2022-02-24  25  25  23
2022-02-02  20  24  24

In [19]:
df.sort_values(by=['D','F'],ascending=[1,0])

             D   E   F
2022-05-23  20  22  25
2022-02-02  20  24  24
2022-08-19  22  20  28
2022-07-28  22  22  24
2022-04-09  22  22  21
2022-03-18  23  23  20
2022-06-14  24  22  23
2022-02-24  25  25  23
2022-07-06  26  20  22
2022-05-01  28  28  24

###### SETS

In [20]:
set1 = {'a',12222,3,4,5,'b','h'}

s2 = {'a','b','name','last_name',50}

set1.update(s2)




print(set1)

{3, 'b', 'h', 4, 5, 'last_name', 50, 'a', 'name', 12222}

In [21]:
set1 ={1,2,3,7,8,7}
set2 ={7,8,5,7,9,10}
set3 ={100,200,300}
set4 ={'a','b',}
set3_1 =set1.union(set2,set4,set3)
set4_1 =set1|set2|set3|set4                     #use union or update for combing all or pipe
print(set3_1)
print(set4_1)
set1.update(set2,set3,set4)
print(set1)

{1, 2, 3, 'b', 5, 100, 7, 8, 9, 10, 200, 300, 'a'}
{1, 2, 3, 100, 5, 'b', 7, 8, 9, 10, 200, 300, 'a'}
{1, 2, 3, 100, 5, 'b', 7, 8, 9, 10, 200, 300, 'a'}

In [22]:
set1 = {1,2,3,7,18,7}
set2 = {7,18,5,7,9,10}
set3 = {1,7,18,3}
set4 = {7,'b',18}                                   #for finding common from all

set5 = set1 & set2 & set3 & set4

set6 = set1.intersection(set2,set3,set4)

print(set5,  "" ,set6)

{18, 7}  {18, 7}

In [23]:
set1 = {1,2,3,7,8,7} # 1,2,3
set2 = {7,8,5,7,9,10} # 9,10
set3 = {1,7,3}
                                          #symmetric difference is used for finding uncommon elements from all sets
set7 = set1.symmetric_difference(set2)
set8 = set3.symmetric_difference(set2)
set9 =set3.symmetric_difference(set1)
print(set3.issubset(set1))

print(set7,set8,set9)

True
{1, 2, 3, 5, 9, 10} {1, 3, 5, 8, 9, 10} {2, 8}

##### DEF

In [24]:
def fn(*a):
    s =0
    for i in a:
        s=s+i
        print(s)
fn(7,8.9,56)

7
15.9
71.9

In [25]:
def fn(a,b,c,d):
    if a>b:
        return(a)
    elif b>c>d:
         return(b)
    else:
        return(c)
fn(34,6,0,-9)

34

In [26]:
# **kwargs
def fn(**a):
    f = {}
    for i in a.keys():
          if i == 'city':
                f[i]=a[i]
                
                                          #            f[i]=a[i]
            
    return f
            
op = fn(id_1 = 'python', city = 'delhi', country = 'india', year = 2022)
op

{'city': 'delhi'}

###### LAMBDA

In [28]:
c=(lambda x,y: x**3 + y)
d=(lambda x,y:x+y)
print(c(2,3))

11

In [29]:
l = ['sam','simi','sassy','ora','duggu','onnu']
name = list(filter(lambda x: len(x)>=4,l))

name

['simi', 'sassy', 'duggu', 'onnu']

In [30]:
l = ['sam','simi','sassy','ora','duggu','onnu']

name = list(filter(lambda x : x.startswith('s')|x.startswith('d'), l)) # endswith
print(name)

['sam', 'simi', 'sassy', 'duggu']

In [31]:
# Example having Both Filter and Map
words=['Alfred', 'Tabitha', 'William', 'Alra','Mandy']

# n = int(input('length of letters:'))

long_words = list(filter(lambda x : len(x)>=5, words))
print('\n Filter OP: ',long_words)

long_words_map = list(map(lambda x : len(x)>=5 , words))
print('\n Map OP: ',long_words_map)

long_words_map = list(map(lambda x :  x if len(x)>=5 else 'less characters' , words))
print('\n Map OP: ',long_words_map)

long_words_map = list(map(lambda x : x if len(x)>4 else 'four' if len(x)==4 else 'less characters' , words))
print('\n Map OP: ',long_words_map)

 Filter OP:  ['Alfred', 'Tabitha', 'William', 'Mandy']

 Map OP:  [True, True, True, False, True]

 Map OP:  ['Alfred', 'Tabitha', 'William', 'less characters', 'Mandy']

 Map OP:  ['Alfred', 'Tabitha', 'William', 'four', 'Mandy']

#### ZIP

In [32]:
arr1=np.array([[1,2,2],
              [4,5,5],
              [5,8,9]])
ua, ac = np.unique(arr1, return_counts=True)
display(ua,ac,dict(zip(ua,ac)))

array([1, 2, 4, 5, 8, 9])

array([1, 2, 1, 3, 1, 1], dtype=int64)

{1: 1, 2: 2, 4: 1, 5: 3, 8: 1, 9: 1}

In [ ]:
APPLY FUNCTION

In [33]:
df = pd.DataFrame([
    ['New York','Mar',12714],
    ['Michigan ','Apr',89238],
    ['Atlanta','Jan',8161],
    ['Boston','Sep',5885],
    ['Birmingham','Mar',10000],
    ['Clanton','Feb',1714],
    ['Marion ','Dec',9238],
    ['Atlantis','Nov',58161],
    ['Alaska','Feb',585],
    ['Arozona','Mar',10000],
    ['Pacfic','Aug',2714],
    ['Ontario ','June',189238],
    ['Toronto','Jan',81651],
    ['Delhi','Oct',58855],
    ['London','Apr',1080],
    ['Texas','Sep',1714],
    ['Washington ','Jul',2038],
    ['Florida','Jan',8161],
    ['Michigan','Oct',58185],
    ['New_Jersy','Apr',10015],
  ],columns=['location','month','sales'])
df

       location month   sales
0      New York   Mar   12714
1     Michigan    Apr   89238
2       Atlanta   Jan    8161
3        Boston   Sep    5885
4    Birmingham   Mar   10000
5       Clanton   Feb    1714
6       Marion    Dec    9238
7      Atlantis   Nov   58161
8        Alaska   Feb     585
9       Arozona   Mar   10000
10       Pacfic   Aug    2714
11     Ontario   June  189238
12      Toronto   Jan   81651
13        Delhi   Oct   58855
14       London   Apr    1080
15        Texas   Sep    1714
16  Washington    Jul    2038
17      Florida   Jan    8161
18     Michigan   Oct   58185
19    New_Jersy   Apr   10015

In [36]:
def fn(x):
    if x>50000:
            return 'A'
    elif 20000<x<50000: #20000
             return 'B'
    else:
        return 'C'
df['sales3']=df.sales.apply(fn)    #works like a for loop (iterates all values(similar to map fn))
# df['sales4']=pd.Series(map(fn,df.sales))   #when done directly without apply fn

In [37]:
df

       location month   sales sales3
0      New York   Mar   12714      C
1     Michigan    Apr   89238      A
2       Atlanta   Jan    8161      C
3        Boston   Sep    5885      C
4    Birmingham   Mar   10000      C
5       Clanton   Feb    1714      C
6       Marion    Dec    9238      C
7      Atlantis   Nov   58161      A
8        Alaska   Feb     585      C
9       Arozona   Mar   10000      C
10       Pacfic   Aug    2714      C
11     Ontario   June  189238      A
12      Toronto   Jan   81651      A
13        Delhi   Oct   58855      A
14       London   Apr    1080      C
15        Texas   Sep    1714      C
16  Washington    Jul    2038      C
17      Florida   Jan    8161      C
18     Michigan   Oct   58185      A
19    New_Jersy   Apr   10015      C

In [38]:
df['sales'].apply(lambda x :  'A' if x>50000 else 'B' if x>20000 else 'c')

0     c
1     A
2     c
3     c
4     c
5     c
6     c
7     A
8     c
9     c
10    c
11    A
12    A
13    A
14    c
15    c
16    c
17    c
18    A
19    c
Name: sales, dtype: object

In [40]:
#or
df['sales4']=pd.Series(map((lambda x :  'A' if x>50000 else 'B' if (20000<x<50000) else 'c'),df.sales))

In [43]:
x=['a','b','c','d']
for i in x:
    print(i,end='')

abcd

##### JOIN FN

In [44]:
' '.join(['hello','there','sup','?']).split(' ')

['hello', 'there', 'sup', '?']

##### LOC FN

In [48]:
df.loc[0:4,'location']

0      New York
1     Michigan
2       Atlanta
3        Boston
4    Birmingham
Name: location, dtype: object

In [49]:
df.loc[[6,8,10],['sales','month']]#In loc you can give column name

    sales month
6    9238   Dec
8     585   Feb
10   2714   Aug

In [52]:
df.iloc[[6,8,10],[1,2]]#IN iloc you just give indexes

   month  sales
6    Dec   9238
8    Feb    585
10   Aug   2714